In [3]:
from urllib.parse import quote_plus

import pandas as pd
from sqlalchemy import create_engine

username = quote_plus("root")
password = quote_plus("J264617221")
server = "127.0.0.1:3306"
db_name = "testdb"

conn = create_engine(
    f"mysql+pymysql://{username}:{password}@{server}/{db_name}",
).connect()

sql = '''
select * from Staff
'''
df = pd.read_sql(sql=sql,con=conn)
df

     ID        Name DeptId  Age Gender  Salary            recordDt
0  S001  Alice Chen   D001   28      F   55000 2025-05-18 09:00:00
1  S002     Bob Lin   D002   35      M   62000 2025-05-18 09:05:00
2  S003    Cathy Wu   D001   42      F   71000 2025-05-18 09:10:00
3  S004   David Hsu   D003   30      M   50000 2025-05-18 09:15:00
4  S005     Eva Lee   D002   25      F   48000 2025-05-18 09:20:00

In [5]:
df.dtypes

ID                  object
Name                object
DeptId              object
Age                  int64
Gender              object
Salary               int64
recordDt    datetime64[ns]
dtype: object

In [6]:
df['Salary'] + 10000

0    65000
1    72000
2    81000
3    60000
4    58000
Name: Salary, dtype: int64

In [7]:
df['Salary'] = df['Salary'] + 10000

In [ ]:
df.to_sql(name='staff',con=conn,if_exists="replace",index=False)

5

In [10]:
conn.commit()